// S12-24_NumberOfPassengers.geojson の型情報


/*
このような形式
{
"type": "FeatureCollection",
"name": "S12-24_NumberOfPassengers",
"crs": { "type": "name", "properties": { "name": "urn:ogc:def:crs:EPSG::6668" } },
"features": [
{ "type": "Feature", "properties": { "S12_001": "二月田", "S12_001c": "010112", "S12_001g": "010112", "S12_002": "九州旅客鉄道", "S12_003": "指宿枕崎線", "S12_004": 11.0, "S12_005": 2.0, "S12_006": 1.0, "S12_007": 3.0, "S12_008": null, "S12_009": 0.0, "S12_010": 1.0, "S12_011": 3.0, "S12_012": null, "S12_013": 0.0, "S12_014": 1.0, "S12_015": 3.0, "S12_016": null, "S12_017": 0.0, "S12_018": 1.0, "S12_019": 3.0, "S12_020": null, "S12_021": 0.0, "S12_022": 1.0, "S12_023": 3.0, "S12_024": null, "S12_025": 0.0, "S12_026": 1.0, "S12_027": 3.0, "S12_028": null, "S12_029": 0.0, "S12_030": 1.0, "S12_031": 3.0, "S12_032": null, "S12_033": 0.0, "S12_034": 1.0, "S12_035": 1.0, "S12_036": null, "S12_037": 658.0, "S12_038": 1.0, "S12_039": 1.0, "S12_040": null, "S12_041": 690.0, "S12_042": 1.0, "S12_043": 1.0, "S12_044": null, "S12_045": 318.0, "S12_046": 1.0, "S12_047": 1.0, "S12_048": null, "S12_049": 305.0, "S12_050": 1.0, "S12_051": 1.0, "S12_052": null, "S12_053": 622.0, "S12_054": 1.0, "S12_055": 1.0, "S12_056": null, "S12_057": 664.0 }, "geometry": { "type": "MultiLineString", "coordinates": [ [ [ 130.63035, 31.25405 ], [ 130.62985, 31.25459 ] ] ] } },
{ "type": "Feature", "properties": { "S12_001": "古島", "S12_001c": "010127", "S12_001g": "010127", "S12_002": "沖縄都市モノレール", "S12_003": "沖縄都市モノレール線", "S12_004": 23.0, "S12_005": 5.0, "S12_006": 1.0, "S12_007": 1.0, "S12_008": null, "S12_009": 3907.0, "S12_010": 1.0, "S12_011": 1.0, "S12_012": null, "S12_013": 3980.0, "S12_014": 1.0, "S12_015": 1.0, "S12_016": null, "S12_017": 4572.0, "S12_018": 1.0, "S12_019": 1.0, "S12_020": null, "S12_021": 4187.0, "S12_022": 1.0, "S12_023": 1.0, "S12_024": null, "S12_025": 4648.0, "S12_026": 1.0, "S12_027": 1.0, "S12_028": null, "S12_029": 4528.0, "S12_030": 1.0, "S12_031": 1.0, "S12_032": null, "S12_033": 4819.0, "S12_034": 1.0, "S12_035": 1.0, "S12_036": null, "S12_037": 5086.0, "S12_038": 1.0, "S12_039": 1.0, "S12_040": null, "S12_041": 5143.0, "S12_042": 1.0, "S12_043": 1.0, "S12_044": null, "S12_045": 3404.0, "S12_046": 1.0, "S12_047": 1.0, "S12_048": null, "S12_049": 3534.0, "S12_050": 1.0, "S12_051": 1.0, "S12_052": null, "S12_053": 4401.0, "S12_054": 1.0, "S12_055": 1.0, "S12_056": null, "S12_057": 4903.0 }, "geometry": { "type": "MultiLineString", "coordinates": [ [ [ 127.70279, 26.23035 ], [ 127.70309, 26.23093 ] ] ] } },
{ "type": "Feature", "properties": { "S12_001": "お台場海浜公園", "S12_001c": "004091", "S12_001g": "004091", "S12_002": "ゆりかもめ", "S12_003": "東京臨海新交通臨海線", "S12_004": 24.0, "S12_005": 5.0, "S12_006": 1.0, "S12_007": 1.0, "S12_008": null, "S12_009": 14612.0, "S12_010": 1.0, "S12_011": 1.0, "S12_012": null, "S12_013": 16130.0, "S12_014": 1.0, "S12_015": 1.0, "S12_016": null, "S12_017": 16357.0, "S12_018": 1.0, "S12_019": 1.0, "S12_020": null, "S12_021": 16515.0, "S12_022": 1.0, "S12_023": 1.0, "S12_024": null, "S12_025": 17537.0, "S12_026": 1.0, "S12_027": 1.0, "S12_028": null, "S12_029": 17488.0, "S12_030": 1.0, "S12_031": 1.0, "S12_032": null, "S12_033": 16944.0, "S12_034": 1.0, "S12_035": 1.0, "S12_036": null, "S12_037": 17165.0, "S12_038": 1.0, "S12_039": 1.0, "S12_040": null, "S12_041": 16899.0, "S12_042": 1.0, "S12_043": 1.0, "S12_044": null, "S12_045": 7703.0, "S12_046": 1.0, "S12_047": 1.0, "S12_048": null, "S12_049": 8535.0, "S12_050": 1.0, "S12_051": 1.0, "S12_052": null, "S12_053": 11171.0, "S12_054": 1.0, "S12_055": 1.0, "S12_056": null, "S12_057": 13195.0 }, "geometry": { "type": "MultiLineString", "coordinates": [ [ [ 139.77818, 35.62961 ], [ 139.77888, 35.63 ] ] ] } },

*/
/*
	属性名
（かっこ内はshp属性名）	説明	属性の型
場所	駅（原則として国土数値情報（鉄道）駅データと同じ位置）	線型（GM_Curve）
駅名
（S12_001）	駅の名称	文字列型（CharacterString）
駅コード
（S12_001c）	駅の緯度を降順に並び替えて付加した一意の番号	文字列型（CharacterString）
グループコード
（S12_001g）	300m以内の距離にある駅で且つ同じ名称の駅を一つのグループとし、グループの重心に最も近い駅コード	文字列型（CharacterString）
運営会社
（S12_002）	運営会社の名称	文字列型（CharacterString）
路線名
（S12_003）	鉄道路線の名称	文字列型（CharacterString）
鉄道区分
（S12_004）	対象鉄道の区分	コードリスト「鉄道区分コード」
事業者種別
（S12_005）	対象運営会社の種別	コードリスト「事業者種別コード」
重複コード2011
（S12_006）	駅別乗降客数データ記載の状況（2011年度）
（複数路線の駅において、一番中心に近い駅にのみデータを付加。以下この項目は同様。）	コードリスト「重複コード」
データ有無コード2011
（S12_007）	乗降客数データの有無（2011年度）	コードリスト「データ有無コード」
備考2011
（S12_008）	原典資料の名称や備考（2011年度）	文字列型（CharacterString）
乗降客数2011
（S12_009）	2011年の駅別乗降客数（人/日）	数値型（Integer）
重複コード2012
（S12_010）	駅別乗降客数データ記載の状況
（2012年度）	コードリスト「重複コード」
データ有無コード2012
（S12_011）	乗降客数データの有無（2012年度）	コードリスト「データ有無コード」
備考2012
（S12_012）	原典資料の名称や備考（2012年度）	文字列型（CharacterString）
乗降客数2012
（S12_013）	2012年の駅別乗降客数（人/日）	数値型（Integer）
重複コード2013
（S12_014）	駅別乗降客数データ記載の状況
（2013年度）	コードリスト「重複コード」
データ有無コード2013
（S12_015）	乗降客数データの有無（2013年度）	コードリスト「データ有無コード」
備考2013
（S12_016）	原典資料の名称や備考（2013年度）	文字列型（CharacterString）
乗降客数2013
（S12_017）	2013年の駅別乗降客数（人/日）	数値型（Integer）
重複コード2014
（S12_018）	駅別乗降客数データ記載の状況
（2014年度）	コードリスト「重複コード」
データ有無コード2014
（S12_019）	乗降客数データの有無（2014年度）	コードリスト「データ有無コード」
備考2014
（S12_020）	原典資料の名称や備考（2014年度）	文字列型（CharacterString）
乗降客数2014
（S12_021）	2014年の駅別乗降客数（人/日）	数値型（Integer）
重複コード2015
（S12_022）	駅別乗降客数データ記載の状況
（2015年度）	コードリスト「重複コード」
データ有無コード2015
（S12_023）	乗降客数データの有無（2015年度）	コードリスト「データ有無コード」
備考2015
（S12_024）	原典資料の名称や備考（2015年度）	文字列型（CharacterString）
乗降客数2015
（S12_025）	2015年の駅別乗降客数（人/日）	数値型（Integer）
重複コード2016
（S12_026）	駅別乗降客数データ記載の状況
（2016年度）	コードリスト「重複コード」
データ有無コード2016
（S12_027）	乗降客数データの有無（2016年度）	コードリスト「データ有無コード」
備考2016
（S12_028）	原典資料の名称や備考（2016年度）	文字列型（CharacterString）
乗降客数2016
（S12_029）	2016年の駅別乗降客数（人/日）	数値型（Integer）
重複コード2017
（S12_030）	駅別乗降客数データ記載の状況
（2017年度）	コードリスト「重複コード」
データ有無コード2017
（S12_031）	乗降客数データの有無（2017年度）	コードリスト「データ有無コード」
備考2017
（S12_032）	原典資料の名称や備考（2017年度）	文字列型（CharacterString）
乗降客数2017
（S12_033）	2017年の駅別乗降客数（人/日）	数値型（Integer）
重複コード2018
（S12_034）	駅別乗降客数データ記載の状況
（2018年度）	コードリスト「重複コード」
データ有無コード2018
（S12_035）	乗降客数データの有無（2018年度）	コードリスト「データ有無コード」
備考2018
（S12_036）	原典資料の名称や備考（2018年度）	文字列型（CharacterString）
乗降客数2018
（S12_037）	2018年の駅別乗降客数（人/日）	数値型（Integer）
重複コード2019
（S12_038）	駅別乗降客数データ記載の状況
（2019年度）	コードリスト「重複コード」
データ有無コード2019
（S12_039）	乗降客数データの有無（2019年度）	コードリスト「データ有無コード」
備考2019
（S12_040）	原典資料の名称や備考（2019年度）	文字列型（CharacterString）
乗降客数2019
（S12_041）	2019年の駅別乗降客数（人/日）	数値型（Integer）
重複コード2020
（S12_042）	駅別乗降客数データ記載の状況
（2020年度）	コードリスト「重複コード」
データ有無コード2020
（S12_043）	乗降客数データの有無（2020年度）	コードリスト「データ有無コード」
備考2020
（S12_044）	原典資料の名称や備考（2020年度）	文字列型（CharacterString）
乗降客数2020
（S12_045）	2020年の駅別乗降客数（人/日）	数値型（Integer）
重複コード2021
（S12_046）	駅別乗降客数データ記載の状況
（2021年度）	コードリスト「重複コード」
データ有無コード2021
（S12_047）	乗降客数データの有無（2021年度）	コードリスト「データ有無コード」
備考2021
（S12_048）	原典資料の名称や備考（2021年度）	文字列型（CharacterString）
乗降客数2021
（S12_049）	2021年の駅別乗降客数（人/日）	数値型（Integer）
重複コード2022
（S12_050）	駅別乗降客数データ記載の状況
（2022年度）	コードリスト「重複コード」
データ有無コード2022
（S12_051）	乗降客数データの有無（2022年度）	コードリスト「データ有無コード」
備考2022
（S12_052）	原典資料の名称や備考（2022年度）	文字列型（CharacterString）
乗降客数2022
（S12_053）	2022年の駅別乗降客数（人/日）	数値型（Integer）
重複コード2023
（S12_054）	駅別乗降客数データ記載の状況
（2023年度）	コードリスト「重複コード」
データ有無コード2023
（S12_055）	乗降客数データの有無（2023年度）	コードリスト「データ有無コード」
備考2023
（S12_056）	原典資料の名称や備考（2023年度）	文字列型（CharacterString）
乗降客数2023
（S12_057）	2023年の駅別乗降客数（人/日）	数値型（Integer）
*/
package giocaltype

func GiotypePassengers struct {
	Type       string `json:"type"`
	Properties struct {
		S12001   string  `json:"S12_001"`    // 駅名
		S12001c  string  `json:"S12_001c"`   // 駅コード
		S12001g  string  `json:"S12_001g"`   // グループコード
		S12002   string  `json:"S12_002"`    // 運営会社
		S12003   string  `json:"S12_003"`    // 路線名
		S12004   float64 `json:"S12_004"`    // 鉄道区分
		S12005   float64 `json:"S12_005"`    // 事業者種別
		S12006   float64 `json:"S12_006"`    // 重複コード2011	
		S12007   float64 `json:"S12_007"`    // データ有無コード2011
		S12008   *string `json:"S12_008"`    // 備考2011
		S12009   float64 `json:"S12_009"`    // 乗降客数2011
		S12010   float64 `json:"S12_010"`    // 重複コード2012
		S12011   float64 `json:"S12_011"`    // データ有無コード2012
		S12012   *string `json:"S12_012"`    // 備考2012
		S12013   float64 `json:"S12_013"`    // 乗降客数2012
		S12014   float64 `json:"S12_014"`    // 重複コード2013
		S12015   float64 `json:"S12_015"`    // データ有無コード2013
		S12016   *string `json:"S12_016"`    // 備考2013
		S12017   float64 `json:"S12_017"`    // 乗降客数2013
		S12018   float64 `json:"S12_018"`    // 重複コード2014
		S12019   float64 `json:"S12_019"`    // データ有無コード2014
		S12020   *string `json:"S12_020"`    // 備考2014
		S12021   float64 `json:"S12_021"`    // 乗降客数2014
		S12022   float64 `json:"S12_022"`    // 重複コード2015
		S12023   float64 `json:"S12_023"`    // データ有無コード2015
		S12024   *string `json:"S12_024"`    // 備考2015
		S12025   float64 `json:"S12_025"`    // 乗降客数2015
		S12026   float64 `json:"S12_026"`    // 重複コード2016
		S12027   float64 `json:"S12_027"`    // データ有無コード2016
		S12028   *string `json:"S12_028"`    // 備考2016
		S12029   float64 `json:"S12_029"`    // 乗降客数2016
		S12030   float64 `json:"S12_030"`    // 重複コード2017
		S12031   float64 `json:"S12_031"`    // データ有無コード2017
		S12032   *string `json:"S12_032"`	// 備考2017
		S12033   float64 `json:"S12_033"`    // 乗降客数2017
		S12034   float64 `json:"S12_034"`    // 重複コード2018	
		S12035   float64 `json:"S12_035"`    // データ有無コード2018
		S12036   *string `json:"S12_036"`    // 備考2018
		S12037   float64 `json:"S12_037"`    // 乗降客数2018
		S12038   float64 `json:"S12_038"`    // 重複コード2019
		S12039   float64 `json:"S12_039"`    // データ有無コード2019
		S12040   *string `json:"S12_040"`    // 備考2019
		S12041   float64 `json:"S12_041"`    // 乗降客数2019
		S12042   float64 `json:"S12_042"`    // 重複コード2020
		S12043   float64 `json:"S12_043"`    // データ有無コード2020
		S12044   *string `json:"S12_044"`    // 備考2020
		S12045   float64 `json:"S12_045"`    // 乗降客数2020
		S12046   float64 `json:"S12_046"`    // 重複コード2021
		S12047   float64 `json:"S12_047"`    // データ有無コード2021
		S12048   *string `json:"S12_048"`    // 備考2021
		S12049   float64 `json:"S12_049"`    // 乗降客数2021
		S12050   float64 `json:"S12_050"`    // 重複コード2022
		S12051   float64 `json:"S12_051"`    // データ有無コード2022
		S12052   *string `json:"S12_052"`    // 備考2022
		S12053   float64 `json:"S12_053"`    // 乗降客数2022
		S12054   float64 `json:"S12_054"`    // 重複コード2023
		S12055   float64 `json:"S12_055"`    // データ有無コード2023
		S12056   *string `json:"S12_056"`    // 備考2023
		S12057   float64 `json:"S12_057"`    // 乗降客数2023
	} `json:"properties"`
	Geometry struct {
		Type        string          `json:"type"`
		Coordinates [][][]float64   `json:"coordinates"`
	} `json:"geometry"`
}